###################################################################

# Created by write_sdc on Fri Dec  7 08:40:49 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_wire_load_mode top
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mplier[7]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mplier[6]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mplier[5]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mplier[4]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mplier[3]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mplier[2]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mplier[1]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mplier[0]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mcand[7]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mcand[6]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mcand[5]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mcand[4]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mcand[3]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mcand[2]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mcand[1]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {mcand[0]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports reset]
set_load -pin_load 0.0156852 [get_ports {q[15]}]
set_load -pin_load 0.0156852 [get_ports {q[14]}]
set_load -pin_load 0.0156852 [get_ports {q[13]}]
set_load -pin_load 0.0156852 [get_ports {q[12]}]
set_load -pin_load 0.0156852 [get_ports {q[11]}]
set_load -pin_load 0.0156852 [get_ports {q[10]}]
set_load -pin_load 0.0156852 [get_ports {q[9]}]
set_load -pin_load 0.0156852 [get_ports {q[8]}]
set_load -pin_load 0.0156852 [get_ports {q[7]}]
set_load -pin_load 0.0156852 [get_ports {q[6]}]
set_load -pin_load 0.0156852 [get_ports {q[5]}]
set_load -pin_load 0.0156852 [get_ports {q[4]}]
set_load -pin_load 0.0156852 [get_ports {q[3]}]
set_load -pin_load 0.0156852 [get_ports {q[2]}]
set_load -pin_load 0.0156852 [get_ports {q[1]}]
set_load -pin_load 0.0156852 [get_ports {q[0]}]
set_load -pin_load 0.0156852 [get_ports cout]
set_load -pin_load 0.0156852 [get_ports done]
set_max_fanout 6 [get_ports {mplier[7]}]
set_max_fanout 6 [get_ports {mplier[6]}]
set_max_fanout 6 [get_ports {mplier[5]}]
set_max_fanout 6 [get_ports {mplier[4]}]
set_max_fanout 6 [get_ports {mplier[3]}]
set_max_fanout 6 [get_ports {mplier[2]}]
set_max_fanout 6 [get_ports {mplier[1]}]
set_max_fanout 6 [get_ports {mplier[0]}]
set_max_fanout 6 [get_ports {mcand[7]}]
set_max_fanout 6 [get_ports {mcand[6]}]
set_max_fanout 6 [get_ports {mcand[5]}]
set_max_fanout 6 [get_ports {mcand[4]}]
set_max_fanout 6 [get_ports {mcand[3]}]
set_max_fanout 6 [get_ports {mcand[2]}]
set_max_fanout 6 [get_ports {mcand[1]}]
set_max_fanout 6 [get_ports {mcand[0]}]
set_max_fanout 6 [get_ports reset]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_uncertainty 1  [get_clocks clk]
set_propagated_clock [get_clocks clk]
set_input_delay -clock clk  -max 0  [get_ports {mplier[7]}]
set_input_delay -clock clk  -max 0  [get_ports {mplier[6]}]
set_input_delay -clock clk  -max 0  [get_ports {mplier[5]}]
set_input_delay -clock clk  -max 0  [get_ports {mplier[4]}]
set_input_delay -clock clk  -max 0  [get_ports {mplier[3]}]
set_input_delay -clock clk  -max 0  [get_ports {mplier[2]}]
set_input_delay -clock clk  -max 0  [get_ports {mplier[1]}]
set_input_delay -clock clk  -max 0  [get_ports {mplier[0]}]
set_input_delay -clock clk  -max 0  [get_ports {mcand[7]}]
set_input_delay -clock clk  -max 0  [get_ports {mcand[6]}]
set_input_delay -clock clk  -max 0  [get_ports {mcand[5]}]
set_input_delay -clock clk  -max 0  [get_ports {mcand[4]}]
set_input_delay -clock clk  -max 0  [get_ports {mcand[3]}]
set_input_delay -clock clk  -max 0  [get_ports {mcand[2]}]
set_input_delay -clock clk  -max 0  [get_ports {mcand[1]}]
set_input_delay -clock clk  -max 0  [get_ports {mcand[0]}]
set_input_delay -clock clk  -max 0  [get_ports reset]
set_output_delay -clock clk  -max 0  [get_ports {q[15]}]
set_output_delay -clock clk  -max 0  [get_ports {q[14]}]
set_output_delay -clock clk  -max 0  [get_ports {q[13]}]
set_output_delay -clock clk  -max 0  [get_ports {q[12]}]
set_output_delay -clock clk  -max 0  [get_ports {q[11]}]
set_output_delay -clock clk  -max 0  [get_ports {q[10]}]
set_output_delay -clock clk  -max 0  [get_ports {q[9]}]
set_output_delay -clock clk  -max 0  [get_ports {q[8]}]
set_output_delay -clock clk  -max 0  [get_ports {q[7]}]
set_output_delay -clock clk  -max 0  [get_ports {q[6]}]
set_output_delay -clock clk  -max 0  [get_ports {q[5]}]
set_output_delay -clock clk  -max 0  [get_ports {q[4]}]
set_output_delay -clock clk  -max 0  [get_ports {q[3]}]
set_output_delay -clock clk  -max 0  [get_ports {q[2]}]
set_output_delay -clock clk  -max 0  [get_ports {q[1]}]
set_output_delay -clock clk  -max 0  [get_ports {q[0]}]
set_output_delay -clock clk  -max 0  [get_ports cout]
set_output_delay -clock clk  -max 0  [get_ports done]
